# Movie Data Analysis

![alt text](images/action.jpg)

## Overview

>This project analysis is determining profitability of a film studio is crucially dependent on picking the right film projects. In order the find the best film project we will find the most popular genres according to our datasets and their profits. Also, another aspect of film projects is their rating. Depending on the case, rating can lower the sales of the movie or totally cross out the movie from existence (Scoot Bowles).

## Business Problem

> Microsoft sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they donâ€™t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of Microsoft's new movie studio can use to help decide what type of films to create.

- Student name: Gamze Turan
- Student pace: self paced 
- Scheduled project review date/time:
- Instructor name: Claude Fried 
- Blog post URL:

> Business situation: Microsoft wants to start a film company.

## Data Understanding

In [1]:
import pandas as pd

In [2]:
df_bom_gross = pd.read_csv('data/bom.movie_gross.csv.gz')
df_imdb_basics = pd.read_csv('data/imdb.title.basics.csv.gz')
df_imdb_rating = pd.read_csv('data/imdb.title.ratings.csv.gz')

In [3]:
df_bom_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [4]:
df_bom_gross.sample(5)

                     title studio  domestic_gross foreign_gross  year
2176                Maggie  RAtt.        187000.0           NaN  2015
3173  Once Upon a Deadpool    Fox       6100000.0      44400000  2018
2088    Testament of Youth    SPC       1800000.0           NaN  2015
1516           Fury (2014)   Sony      85800000.0     126000000  2014
404        Red Riding Hood     WB      37700000.0      51500000  2011

In [5]:
df_imdb_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [6]:
df_imdb_basics.sample(5)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
63531,tt3651036,Community Acupuncture: The Calmest Revolution ...,Community Acupuncture: The Calmest Revolution ...,2014,35.0,"Documentary,News"
124396,tt7557502,Practice,Practice,2017,10.0,"Documentary,Sport"
142866,tt9434778,Chinese Portrait,Chinese Portrait,2018,NaN,Documentary
15642,tt1742067,Mapa Para Conversar,Mapa Para Conversar,2012,81.0,"Drama,Romance"
94160,tt5487716,Houses Without Doors,Manazil bela abwab,2016,90.0,Documentary

In [7]:
df_imdb_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [8]:
df_imdb_rating.sample(5)

          tconst  averagerating  numvotes
39009  tt6980984            6.7        15
63823  tt3712554            6.8         9
37343  tt6932888            6.2        11
69901  tt6101602            6.4      2497
64768  tt7299388            5.9        59

# Bom Movie Data

In [9]:
df_bom_gross = pd.read_csv('data/bom.movie_gross.csv.gz')
df_bom_gross.sample(5)

                 title  studio  domestic_gross foreign_gross  year
2729  The Sea of Trees     A24         20400.0           NaN  2016
2595             Viral  W/Dim.             NaN        552000  2016
1931          Get Hard      WB      90400000.0      21400000  2015
3335      Mary Shelley     IFC        109000.0           NaN  2018
326        Kimjongilia   Lorb.          4400.0           NaN  2010

In [10]:
# to check if there are any duplication
df_bom_gross.duplicated().value_counts()

False    3387
dtype: int64

In [11]:
# NaN values in the datasets
df_bom_gross.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

# Imdb Data

In [12]:
df_imdb_basics = pd.read_csv('data/imdb.title.basics.csv.gz')
df_imdb_basics.sample(5)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
61893,tt3569230,Legend,Legend,2015,132.0,"Biography,Crime,Drama"
53116,tt3132100,FÃ¡tima o el Parque de la Fraternidad,FÃ¡tima o el Parque de la Fraternidad,2015,90.0,Drama
126419,tt7718854,My Ras Tafari Roots,My Ras Tafari Roots,2016,80.0,Documentary
73293,tt4175088,Radical Grace,Radical Grace,2015,86.0,"Documentary,News"
38084,tt2373132,The Accidental Missionary,The Accidental Missionary,2012,103.0,"Comedy,Family,Romance"

In [13]:
df_imdb_rating = pd.read_csv('data/imdb.title.ratings.csv.gz')
df_imdb_rating.sample(5)

          tconst  averagerating  numvotes
54778  tt1844016            5.0       119
73627  tt7470156            7.6        27
62172  tt1830499            4.7       460
30724  tt2692502            8.4        11
68728  tt6095002            7.0       273

# Merge Data

In [14]:
# merge basics in rating based on tconst
df_merge = pd.merge(df_imdb_basics,df_imdb_rating, on="tconst")
df_merge

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119
...,...,...,...,...,...,...,...,...
73851,tt9913084,Diabolik sono io,Diabolik sono io,2019,75.0,Documentary,6.2,6
73852,tt9914286,Sokagin Ã‡ocuklari,Sokagin Ã‡ocuklari,2019,98.0,"Drama,Family",8.7,136
73853,tt9914642,Albatross,Albatross,2017,NaN,Documentary,8.5,8
73854,tt9914942,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,NaN,6.6,5
73855,tt9916160,DrÃ¸mmeland,DrÃ¸mmeland,2019,72.0,Documentary,6.5,11

In [15]:
# drop the dublicated info column
df_merge = df_merge.drop(['tconst', 'runtime_minutes'], axis=1)
df_merge

,primary_title,original_title,start_year,genres,averagerating,numvotes
0,Sunghursh,Sunghursh,2013,"Action,Crime,Drama",7.0,77
1,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama",7.2,43
2,The Other Side of the Wind,The Other Side of the Wind,2018,Drama,6.9,4517
3,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama",6.1,13
4,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy",6.5,119
...,...,...,...,...,...,...
73851,Diabolik sono io,Diabolik sono io,2019,Documentary,6.2,6
73852,Sokagin Ã‡ocuklari,Sokagin Ã‡ocuklari,2019,"Drama,Family",8.7,136
73853,Albatross,Albatross,2017,Documentary,8.5,8
73854,La vida sense la Sara Amat,La vida sense la Sara Amat,2019,NaN,6.6,5
73855,DrÃ¸mmeland,DrÃ¸mmeland,2019,Documentary,6.5,11

In [16]:
# creating a new column called title and its contain the same values from the original title
df_merge['title'] = df_merge['original_title']

In [17]:
# 2nd merge bom_gross and df_merge based on title
df_merge = pd.merge(df_bom_gross, df_merge, on="title", how='inner')
df_merge

,title,studio,domestic_gross,foreign_gross,year,primary_title,original_title,start_year,genres,averagerating,numvotes
0,Toy Story 3,BV,415000000.0,652000000,2010,Toy Story 3,Toy Story 3,2010,"Adventure,Animation,Comedy",8.3,682218
1,Inception,WB,292600000.0,535700000,2010,Inception,Inception,2010,"Action,Adventure,Sci-Fi",8.8,1841066
2,Shrek Forever After,P/DW,238700000.0,513900000,2010,Shrek Forever After,Shrek Forever After,2010,"Adventure,Animation,Comedy",6.3,167532
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010,The Twilight Saga: Eclipse,The Twilight Saga: Eclipse,2010,"Adventure,Drama,Fantasy",5.0,211733
4,Iron Man 2,Par.,312400000.0,311500000,2010,Iron Man 2,Iron Man 2,2010,"Action,Adventure,Sci-Fi",7.0,657690
...,...,...,...,...,...,...,...,...,...,...,...
2442,Loving Pablo,Uni.,22000.0,NaN,2018,Loving Pablo,Loving Pablo,2017,"Action,Biography,Crime",6.3,13988
2443,The Escape,IFC,14000.0,NaN,2018,The Escape,The Escape,2017,Drama,5.9,1290
2444,Souvenir,Strand,11400.0,NaN,2018,Souvenir,Souvenir,2016,"Drama,Music,Romance",6.0,823
2445,Souvenir,Strand,11400.0,NaN,2018,Souvenir,Souvenir,2014,"Comedy,Romance",5.9,9
2446,An Actor Prepares,Grav.,1700.0,NaN,2018,An Actor Prepares,An Actor Prepares,2018,Comedy,5.0,388

In [18]:
df_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2447 entries, 0 to 2446
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2447 non-null   object
 1   studio          2444 non-null   object
 2   domestic_gross  2429 non-null   float64
 3   foreign_gross   1573 non-null   object
 4   year            2447 non-null   int64
 5   primary_title   2447 non-null   object
 6   original_title  2447 non-null   object
 7   start_year      2447 non-null   int64
 8   genres          2443 non-null   object
 9   averagerating   2447 non-null   float64
 10  numvotes        2447 non-null   int64
dtypes: float64(2), int64(3), object(6)
memory usage: 229.4+ KB

# Data Cleaning

In [19]:
# drop  column
df_merge = df_merge.drop(['studio', 'original_title', 'primary_title', 'year'], axis=1)
df_merge.sample(5)

,title,domestic_gross,foreign_gross,start_year,genres,averagerating,numvotes
2328,Nobody's Fool,31700000.0,1800000,2018,"Comedy,Drama,Romance",4.6,3618
2062,The Big Sick,42900000.0,13500000,2017,"Comedy,Drama,Romance",7.6,104008
297,J. Edgar,37300000.0,47600000,2011,"Biography,Crime,Drama",6.6,115925
60,The Girl with the Dragon Tattoo,10100000.0,94300000,2011,"Crime,Drama,Mystery",7.8,387580
826,Elysium,93100000.0,193100000,2010,Drama,6.0,6

In [20]:
df_merge['domestic_gross'].fillna(value=df_merge['domestic_gross'].median(), inplace=True)

In [21]:
df_merge['foreign_gross'].fillna(value=0, inplace=True)

In [22]:
# creating a function to replase str to float and remove ","
def parsecomma(x):
    if type(x)== str:
        return float(x.replace(',',''))
    else:
        return 0

In [23]:
# used Transform function to transform values by passing each into parsecomma
df_merge['foreign_gross'] = df_merge['foreign_gross'].transform(parsecomma)

In [29]:
# turning NaN values into empty strings
df_merge['genres'].fillna('', inplace=True)

In [30]:
df_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2447 entries, 0 to 2446
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2447 non-null   object
 1   domestic_gross  2447 non-null   float64
 2   foreign_gross   2447 non-null   float64
 3   start_year      2447 non-null   int64
 4   genres          2447 non-null   object
 5   averagerating   2447 non-null   float64
 6   numvotes        2447 non-null   int64
dtypes: float64(3), int64(2), object(2)
memory usage: 152.9+ KB

In [32]:
df_merge.describe()

       domestic_gross  foreign_gross   start_year  averagerating      numvotes
count    2.447000e+03   2.447000e+03  2447.000000    2447.000000  2.447000e+03
mean     3.589619e+07   5.245668e+07  2013.774418       6.406293  7.273033e+04
std      6.931818e+07   1.185166e+08     2.496398       1.045029  1.345874e+05
min      1.000000e+02   0.000000e+00  2010.000000       1.600000  5.000000e+00
25%      3.045000e+05   0.000000e+00  2012.000000       5.800000  3.776000e+03
50%      5.100000e+06   4.200000e+06  2014.000000       6.500000  2.074600e+04
75%      4.265000e+07   4.470000e+07  2016.000000       7.100000  8.063900e+04
max      7.001000e+08   9.464000e+08  2019.000000       9.200000  1.841066e+06

In [33]:
# sample of final data
df_merge.sample(5)

,title,domestic_gross,foreign_gross,start_year,genres,averagerating,numvotes
2357,Boy Erased,6800000.0,5000000.0,2018,"Biography,Drama",7.0,18768
180,Howl,617000.0,566000.0,2015,"Action,Fantasy,Horror",5.3,9732
1214,The Good Lie,2700000.0,0.0,2012,Thriller,6.4,87
758,Dark Horse,166000.0,0.0,2015,"Documentary,Drama",7.3,908
2323,Overlord,21700000.0,20000000.0,2018,"Action,Adventure,Horror",6.7,56108

# Feature Engineering
> I create a total_gross feature to combine domestic and foreign gross to indicate total profit.

In [36]:
df_merge['total_gross'] = df_merge['domestic_gross'] + df_merge['foreign_gross']
df_merge['total_gross']

0       1.067000e+09
1       8.283000e+08
2       7.526000e+08
3       6.985000e+08
4       6.239000e+08
            ...
2442    2.200000e+04
2443    1.400000e+04
2444    1.140000e+04
2445    1.140000e+04
2446    1.700000e+03
Name: total_gross, Length: 2447, dtype: float64

> I created a genres_dict with the total counts of each genre

In [45]:
genres = dict()
for i, row in df_merge.iterrows():
    for genre in row['genres'].split(','):
        if not genre in genres:
            genres[genre] = 0
        genres[genre] += 1

In [47]:
genres

{'Adventure': 381,
 'Animation': 113,
 'Comedy': 791,
 'Action': 527,
 'Sci-Fi': 128,
 'Drama': 1354,
 'Fantasy': 135,
 'Family': 105,
 'Biography': 256,
 'History': 99,
 'Thriller': 380,
 '': 4,
 'Romance': 377,
 'Horror': 223,
 'Mystery': 177,
 'Western': 18,
 'Crime': 330,
 'Documentary': 206,
 'Sport': 54,
 'War': 30,
 'Music': 84,
 'Musical': 15,
 'News': 4}

In [49]:
# allows sorted to sort on a index 1
import operator

In [50]:
sorted_x = sorted(genres.items(), key=operator.itemgetter(1))[10:]
sorted_x

[('Sci-Fi', 128),
 ('Fantasy', 135),
 ('Mystery', 177),
 ('Documentary', 206),
 ('Horror', 223),
 ('Biography', 256),
 ('Crime', 330),
 ('Romance', 377),
 ('Thriller', 380),
 ('Adventure', 381),
 ('Action', 527),
 ('Comedy', 791),
 ('Drama', 1354)]

 # Analysis

In [51]:
import matplotlib
import matplotlib.pyplot as plt

%matplotlib inline

### Popularity of Genres

In [ ]:
fig, ax = plt.subplots()

# Use plot() function to create a plot using above values
ax.plot(years, data)

# Add labels for x and y axes
ax.set_xlabel('X Axis Label')
ax.set_ylabel('Y Axis Label')

# Add a title for the plot
ax.set_title('PLOT TITLE')

# Add a legend to the plot with legend() in lower right corner
ax.legend(["Sample Data"], loc=4);

### Sales in Genres

### Cost of Movie

# Conclusion